shared_with_qemu/fio_results/iomap_v1_8G_mem_read_bs-10M_20250808-205447.log
buffered-read: (g=0): rw=read, bs=(R) 10.0MiB-10.0MiB, (W) 10.0MiB-10.0MiB, (T) 10.0MiB-10.0MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=836: Fri Aug  8 20:54:48 2025
  read: IOPS=309, BW=3091MiB/s (3241MB/s)(1020MiB/330msec)
    clat (usec): min=2453, max=15848, avg=3185.36, stdev=1302.68
     lat (usec): min=2455, max=15954, avg=3187.82, stdev=1312.76
    clat percentiles (usec):
     |  1.00th=[ 2540],  5.00th=[ 2704], 10.00th=[ 2769], 20.00th=[ 2835],
     | 30.00th=[ 2900], 40.00th=[ 2933], 50.00th=[ 2999], 60.00th=[ 3064],
     | 70.00th=[ 3163], 80.00th=[ 3228], 90.00th=[ 3556], 95.00th=[ 3752],
     | 99.00th=[ 4047], 99.50th=[15795], 99.90th=[15795], 99.95th=[15795],
     | 99.99th=[15795]
  lat (msec)   : 4=98.04%, 10=0.98%, 20=0.98%
  cpu          : usr=1.82%, sys=84.80%, ctx=57, majf=0, minf=528
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=102,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3091MiB/s (3241MB/s), 3091MiB/s-3091MiB/s (3241MB/s-3241MB/s), io=1020MiB (1070MB), run=330-330msec

Disk stats (read/write):
  vdc: ios=87/0, sectors=663568/0, merge=1/0, ticks=90/0, in_queue=90, util=28.70%