shared_with_qemu/fio_results/iomap_v1_8G_mem_read_bs-128k_20250808-205600.log
buffered-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1604: Fri Aug  8 20:56:01 2025
  read: IOPS=11.9k, BW=1488MiB/s (1561MB/s)(1024MiB/688msec)
    clat (usec): min=24, max=2209, avg=79.79, stdev=68.13
     lat (usec): min=25, max=2319, avg=80.43, stdev=68.49
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   28], 10.00th=[   28], 20.00th=[   30],
     | 30.00th=[   32], 40.00th=[   49], 50.00th=[   56], 60.00th=[   63],
     | 70.00th=[   92], 80.00th=[  123], 90.00th=[  194], 95.00th=[  212],
     | 99.00th=[  253], 99.50th=[  293], 99.90th=[  400], 99.95th=[  469],
     | 99.99th=[ 2212]
   bw (  MiB/s): min= 1509, max= 1509, per=100.00%, avg=1509.25, stdev= 0.00, samples=1
   iops        : min=12076, max=12076, avg=12076.00, stdev= 0.00, samples=1
  lat (usec)   : 50=41.92%, 100=33.24%, 250=23.82%, 500=0.98%, 750=0.01%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 4=0.01%
  cpu          : usr=4.80%, sys=45.56%, ctx=1314, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1488MiB/s (1561MB/s), 1488MiB/s-1488MiB/s (1561MB/s-1561MB/s), io=1024MiB (1074MB), run=688-688msec

Disk stats (read/write):
  vdc: ios=3680/0, sectors=1883152/0, merge=0/0, ticks=615/0, in_queue=615, util=38.17%