shared_with_qemu/fio_results/iomap_v1_8G_mem_read_bs-4k_20250808-205556.log
buffered-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1580: Fri Aug  8 20:55:59 2025
  read: IOPS=145k, BW=568MiB/s (596MB/s)(1024MiB/1803msec)
    clat (usec): min=2, max=1121, avg= 4.93, stdev=11.72
     lat (usec): min=2, max=1228, avg= 5.27, stdev=12.38
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    8],
     | 99.00th=[   69], 99.50th=[   83], 99.90th=[  133], 99.95th=[  178],
     | 99.99th=[  265]
   bw (  KiB/s): min=496600, max=681133, per=98.10%, avg=570552.33, stdev=97567.07, samples=3
   iops        : min=124150, max=170301, avg=142645.33, stdev=24401.08, samples=3
  lat (usec)   : 4=90.77%, 10=5.67%, 20=0.49%, 50=1.50%, 100=1.37%
  lat (usec)   : 250=0.18%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=57.88%, sys=25.03%, ctx=28, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=568MiB/s (596MB/s), 568MiB/s-568MiB/s (596MB/s-596MB/s), io=1024MiB (1074MB), run=1803-1803msec

Disk stats (read/write):
  vdc: ios=3634/0, sectors=1856016/0, merge=0/0, ticks=801/0, in_queue=801, util=38.54%