shared_with_qemu/fio_results/iomap_v1_hole_8G_mem_read_bs-10M_20250809-101505.log
buffered-read: (g=0): rw=read, bs=(R) 10.0MiB-10.0MiB, (W) 10.0MiB-10.0MiB, (T) 10.0MiB-10.0MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=2055: Sat Aug  9 10:15:06 2025
  read: IOPS=176, BW=1768MiB/s (1854MB/s)(1020MiB/577msec)
    clat (usec): min=4407, max=24454, avg=5587.84, stdev=1991.89
     lat (usec): min=4409, max=24620, avg=5591.30, stdev=2007.15
    clat percentiles (usec):
     |  1.00th=[ 4424],  5.00th=[ 4490], 10.00th=[ 4555], 20.00th=[ 4621],
     | 30.00th=[ 5014], 40.00th=[ 5211], 50.00th=[ 5407], 60.00th=[ 5538],
     | 70.00th=[ 5800], 80.00th=[ 6063], 90.00th=[ 6259], 95.00th=[ 6456],
     | 99.00th=[ 6849], 99.50th=[24511], 99.90th=[24511], 99.95th=[24511],
     | 99.99th=[24511]
   bw (  MiB/s): min= 1740, max= 1740, per=98.43%, avg=1740.00, stdev= 0.00, samples=1
   iops        : min=  174, max=  174, avg=174.00, stdev= 0.00, samples=1
  lat (msec)   : 10=99.02%, 50=0.98%
  cpu          : usr=1.56%, sys=95.83%, ctx=1, majf=0, minf=528
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=102,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1768MiB/s (1854MB/s), 1768MiB/s-1768MiB/s (1854MB/s-1854MB/s), io=1020MiB (1070MB), run=577-577msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%