shared_with_qemu/fio_results/iomap_v1_hole_8G_mem_read_bs-1G_20250809-101802.log
buffered-read: (g=0): rw=read, bs=(R) 1024MiB-1024MiB, (W) 1024MiB-1024MiB, (T) 1024MiB-1024MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=3209: Sat Aug  9 10:18:05 2025
  read: IOPS=0, BW=788MiB/s (826MB/s)(1024MiB/1300msec)
    clat (nsec): min=1297.1M, max=1297.1M, avg=1297066883.00, stdev= 0.00
     lat (nsec): min=1297.4M, max=1297.4M, avg=1297353455.00, stdev= 0.00
    clat percentiles (msec):
     |  1.00th=[ 1301],  5.00th=[ 1301], 10.00th=[ 1301], 20.00th=[ 1301],
     | 30.00th=[ 1301], 40.00th=[ 1301], 50.00th=[ 1301], 60.00th=[ 1301],
     | 70.00th=[ 1301], 80.00th=[ 1301], 90.00th=[ 1301], 95.00th=[ 1301],
     | 99.00th=[ 1301], 99.50th=[ 1301], 99.90th=[ 1301], 99.95th=[ 1301],
     | 99.99th=[ 1301]
  lat (msec)   : 2000=100.00%
  cpu          : usr=0.15%, sys=98.54%, ctx=0, majf=0, minf=1035
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=788MiB/s (826MB/s), 788MiB/s-788MiB/s (826MB/s-826MB/s), io=1024MiB (1074MB), run=1300-1300msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%