shared_with_qemu/fio_results/iomap_v1_patch_8G_mem_write_bs-10M_20250812-181905.log
buffered-write: (g=0): rw=write, bs=(R) 10.0MiB-10.0MiB, (W) 10.0MiB-10.0MiB, (T) 10.0MiB-10.0MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=836: Tue Aug 12 18:19:06 2025
  write: IOPS=297, BW=2977MiB/s (3121MB/s)(1030MiB/346msec); 0 zone resets
    clat (usec): min=2591, max=3449, avg=2849.39, stdev=168.30
     lat (usec): min=2968, max=4036, avg=3300.35, stdev=196.47
    clat percentiles (usec):
     |  1.00th=[ 2606],  5.00th=[ 2638], 10.00th=[ 2671], 20.00th=[ 2704],
     | 30.00th=[ 2737], 40.00th=[ 2802], 50.00th=[ 2835], 60.00th=[ 2868],
     | 70.00th=[ 2900], 80.00th=[ 2966], 90.00th=[ 3064], 95.00th=[ 3228],
     | 99.00th=[ 3425], 99.50th=[ 3458], 99.90th=[ 3458], 99.95th=[ 3458],
     | 99.99th=[ 3458]
  lat (msec)   : 4=100.00%
  cpu          : usr=10.12%, sys=88.73%, ctx=1, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,103,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2977MiB/s (3121MB/s), 2977MiB/s-2977MiB/s (3121MB/s-3121MB/s), io=1030MiB (1080MB), run=346-346msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%