shared_with_qemu/fio_results/iomap_v1_patch_8G_mem_write_bs-1G_20250813-103710.log
buffered-write: (g=0): rw=write, bs=(R) 1024MiB-1024MiB, (W) 1024MiB-1024MiB, (T) 1024MiB-1024MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=549: Wed Aug 13 10:37:12 2025
  write: IOPS=2, BW=2333MiB/s (2446MB/s)(1024MiB/439msec); 0 zone resets
    clat (nsec): min=340142k, max=340142k, avg=340142092.00, stdev= 0.00
     lat (nsec): min=428710k, max=428710k, avg=428710379.00, stdev= 0.00
    clat percentiles (msec):
     |  1.00th=[  342],  5.00th=[  342], 10.00th=[  342], 20.00th=[  342],
     | 30.00th=[  342], 40.00th=[  342], 50.00th=[  342], 60.00th=[  342],
     | 70.00th=[  342], 80.00th=[  342], 90.00th=[  342], 95.00th=[  342],
     | 99.00th=[  342], 99.50th=[  342], 99.90th=[  342], 99.95th=[  342],
     | 99.99th=[  342]
  lat (msec)   : 500=100.00%
  cpu          : usr=19.86%, sys=78.31%, ctx=1, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2333MiB/s (2446MB/s), 2333MiB/s-2333MiB/s (2446MB/s-2446MB/s), io=1024MiB (1074MB), run=439-439msec

Disk stats (read/write):
  vdc: ios=0/12, sectors=0/96, merge=0/0, ticks=0/6, in_queue=6, util=0.00%